  ### Deployment Results ✅

  **jcetina** successfully **noop** deployed branch `jcetina/more-sites/build` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/4eb887c0-eb55-41b6-b0ed-e0a606dc10b8/terraform-bin plan -no-color -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

# azurerm_virtual_network_gateway_connection.east_west will be created
+ resource "azurerm_virtual_network_gateway_connection" "east_west" {
    + connection_mode                    = "Default"
    + connection_protocol                = (known after apply)
    + enable_bgp                         = (known after apply)
    + express_route_gateway_bypass       = (known after apply)
    + id                                 = (known after apply)
    + location                           = "eastus2"
    + name                               = "east-west-connection"
    + peer_virtual_network_gateway_id    = (known after apply)
    + resource_group_name                = "org-jcetina-repo-baklava-rg"
    + routing_weight                     = (known after apply)
    + shared_key                         = (sensitive value)
    + type                               = "Vnet2Vnet"
    + use_policy_based_traffic_selectors = (known after apply)
    + virtual_network_gateway_id         = (known after apply)
  }

# azurerm_virtual_network_gateway_connection.west_east will be created
+ resource "azurerm_virtual_network_gateway_connection" "west_east" {
    + connection_mode                    = "Default"
    + connection_protocol                = (known after apply)
    + enable_bgp                         = (known after apply)
    + express_route_gateway_bypass       = (known after apply)
    + id                                 = (known after apply)
    + location                           = "westus2"
    + name                               = "west-east-connection"
    + peer_virtual_network_gateway_id    = (known after apply)
    + resource_group_name                = "org-jcetina-repo-baklava-rg"
    + routing_weight                     = (known after apply)
    + shared_key                         = (sensitive value)
    + type                               = "Vnet2Vnet"
    + use_policy_based_traffic_selectors = (known after apply)
    + virtual_network_gateway_id         = (known after apply)
  }

# module.sites["eastus2"].azurerm_public_ip.gateway will be created
+ resource "azurerm_public_ip" "gateway" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 15
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus2"
    + name                    = "azure-eastus2-vgw-pip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

# module.sites["eastus2"].azurerm_subnet.gateway will be created
+ resource "azurerm_subnet" "gateway" {
    + address_prefixes                               = [
        + "10.0.0.0/27",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "GatewaySubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "azure-eastus2"
  }

# module.sites["eastus2"].azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.0.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus2"
    + name                = "azure-eastus2"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

# module.sites["eastus2"].azurerm_virtual_network_gateway.gateway will be created
+ resource "azurerm_virtual_network_gateway" "gateway" {
    + active_active       = (known after apply)
    + enable_bgp          = false
    + generation          = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus2"
    + name                = "azure-eastus2-vgw"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku                 = "VpnGw2AZ"
    + type                = "Vpn"
    + vpn_type            = "RouteBased"

    + bgp_settings {
        + asn         = (known after apply)
        + peer_weight = (known after apply)

        + peering_addresses {
            + apipa_addresses       = (known after apply)
            + default_addresses     = (known after apply)
            + ip_configuration_name = (known after apply)
            + tunnel_ip_addresses   = (known after apply)
          }
      }

    + ip_configuration {
        + name                          = "vnetGatewayConfig"
        + private_ip_address_allocation = "Dynamic"
        + public_ip_address_id          = (known after apply)
        + subnet_id                     = (known after apply)
      }
  }

# module.sites["westus"].azurerm_subnet.gateway will be destroyed
# (because module.sites["westus"] is not in configuration)
- resource "azurerm_subnet" "gateway" {
    - address_prefixes                               = [
        - "10.1.0.0/27",
      ] -> null
    - enforce_private_link_endpoint_network_policies = false -> null
    - enforce_private_link_service_network_policies  = false -> null
    - id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus/subnets/GatewaySubnet" -> null
    - name                                           = "GatewaySubnet" -> null
    - resource_group_name                            = "org-jcetina-repo-baklava-rg" -> null
    - service_endpoint_policy_ids                    = [] -> null
    - service_endpoints                              = [] -> null
    - virtual_network_name                           = "azure-westus" -> null
  }

# module.sites["westus"].azurerm_virtual_network.vnet will be destroyed
# (because module.sites["westus"] is not in configuration)
- resource "azurerm_virtual_network" "vnet" {
    - address_space           = [
        - "10.1.0.0/16",
      ] -> null
    - dns_servers             = [] -> null
    - flow_timeout_in_minutes = 0 -> null
    - guid                    = "58ca0b0a-08ab-4566-ad6c-d6b7dc606481" -> null
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus" -> null
    - location                = "westus" -> null
    - name                    = "azure-westus" -> null
    - resource_group_name     = "org-jcetina-repo-baklava-rg" -> null
    - subnet                  = [
        - {
            - address_prefix = "10.1.0.0/27"
            - id             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus/subnets/GatewaySubnet"
            - name           = "GatewaySubnet"
            - security_group = ""
          },
      ] -> null
    - tags                    = {} -> null
  }

# module.sites["westus2"].azurerm_public_ip.gateway will be created
+ resource "azurerm_public_ip" "gateway" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 15
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "westus2"
    + name                    = "azure-westus2-vgw-pip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

# module.sites["westus2"].azurerm_subnet.gateway will be created
+ resource "azurerm_subnet" "gateway" {
    + address_prefixes                               = [
        + "10.1.0.0/27",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "GatewaySubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "azure-westus2"
  }

# module.sites["westus2"].azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.1.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "westus2"
    + name                = "azure-westus2"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

# module.sites["westus2"].azurerm_virtual_network_gateway.gateway will be created
+ resource "azurerm_virtual_network_gateway" "gateway" {
    + active_active       = (known after apply)
    + enable_bgp          = false
    + generation          = (known after apply)
    + id                  = (known after apply)
    + location            = "westus2"
    + name                = "azure-westus2-vgw"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku                 = "VpnGw2AZ"
    + type                = "Vpn"
    + vpn_type            = "RouteBased"

    + bgp_settings {
        + asn         = (known after apply)
        + peer_weight = (known after apply)

        + peering_addresses {
            + apipa_addresses       = (known after apply)
            + default_addresses     = (known after apply)
            + ip_configuration_name = (known after apply)
            + tunnel_ip_addresses   = (known after apply)
          }
      }

    + ip_configuration {
        + name                          = "vnetGatewayConfig"
        + private_ip_address_allocation = "Dynamic"
        + public_ip_address_id          = (known after apply)
        + subnet_id                     = (known after apply)
      }
  }

Plan: 10 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

  </details>